[
  {
   "title": "임상신경정신약물학",
    "author": "박원명 | 김찬형",
    "page" : [22,23,24,25,26,27,28],
    "text" : "정신약물학의 역사적 개요 01chapter\n\n현대정신의학은 19세기 후반 유럽의 정신과 의사들이 임상적으로 관찰된 다양한 증상에서 정신질환들을 구분해내면서부터 시작되었다. 하지만 20세기 초반까지도 정신질환의 효과적인 치료법은 거의 존재하지 않았으며, 환자들은 방치되거나 부적절한 치료에 노출되는 일이 빈번하였다. 이러한 상황에서 1950년대 chlorpromazine을 필두로 한 정신신경계 약물의 개발은 정신질환의 치료에 획기적인 전기를 부여했을 뿐 아니라 질환의 병태생리를 규명하는 데도 큰 기여를 하였다. 정신과 영역에서는 우연히 효과가 발견된 약물의 기전을 밝혀내는 과정에서 질환의 병태생리가 규명되거나 개량 약물이 파생되는 경우가 많았기 때문이다. 아직까지 약물치료가 정신질환의 근원을 치료하는 수준에 이르지는 못하였으나, 정신질환의 가장 훌륭한 치료법이라는 사실은 여러 연구결과 및 임상적 치료를 통하여 인정받고 있다.\n\n주류 정신의학계에서 정신분석의 영향이 줄어들기 시작한 1970년대에 이르러, Hollister는 약물치료를 바라보는 시각이 변화하였음을 기술하였다. 그는 환자는 의사에게 이해 받기에 앞서 의학적 도움을 받기를 원하며, 약물치료를 통하여 정신적 고통을 경감시키고, 기분을 향상시키는 것은 잘못된 일이나 비윤리적인 일이 아니므로 약물치료가 정신질환의 훌륭한 치료법이 될 수 있다고 주장하였다. 이후 정신약물학은 비약적인 발전을 거듭하며, 현재까지 새로운 약물들의 개발 및 기존 약물의 추가적인 효과에 대한 규명이 지속되고 있다. 정신질환의 병태생리에 대한 이해가 증진되고, 약물의 기전 및 적응증이 확장되면서 미래에는 기존 약물의 계열 간 구분의 경계가 희미해질 것으로 보인다. 이 장에서는 전통적인 약물 분류에 따라 역 사적인 흐름을 조망해 보고자 한다.\n\n1.1 항정신병약물 Antipsychotics\n\n제2차 세계대전 당시 프랑스의 Rhône-Poulenc 제약사 연구진들은 항말라리아제 개발과정에서 phenothiazine 계 유도체를 다수 합성하였으며, 이 약물들의 강력한 antihistamine 작용을 알게 되었다. 당시 약리학자였던 Laborit는 ‘인공동면 artificial hibernation’을 유도하는 물질을 찾던 중, phenothiazine 유도체의 진정효과에 대하여 관심을 가지게 되었다. 그는 특히 chlorpromazine이 동물실험에서 저체온증을 유발하고, 수술환자에서 마취효과를<|page|>향상시킨다는 것을 알게 되었고, 이 약물이 정신질환의 치료에도 도움이 될 것으로 기대하였다. 그래서 그는 지인이자 정신과 의사인 Hamon과 Delay에게 이 약물의 사용을 권유하였다. 이에 1952년 1월 19일 프랑스 파리의 한 병원에서 Hamon에 의하여 정신과 환자에게 chlorpromazine이 최초로 투여되었다. 이후 Delay와 Deniker는 38명의 초조 증상을 동반한 정신병 환자들에게 chlorpromazine 75~150mg/day를 투여하는 임상연구를 시행하였고, 1952년 5월에 그 결과를 발표하였다. 연구결과에 의하면, 이전의 충격요법이나 수면치료에 반응이 없었던 환자들에서 조증 및 초조 증상, 공격성, 망상이 호전되었으며, 이러한 약물의 효과는 의식 혼란의 부작용을 가진 과거의 진정제들과 구분되는 것이었다. chlorpromazine의 항정신병 효과를 발견한 것은 정신의학사의 혁명적인 사건으로 기록되었으며, 이 약물의 도입으로 정신병원에 단순히 수용되어 있던 환자들의 수는 급감하게 되었다.\n\n이후 chlorpromazine의 사용은 프랑스뿐 아니라 유럽 전역과 미국으로 확산되었다. 1954년 미국정신의학회지인 Archives of Neurology and Psychiatry에 첫 임상 결과가 보고되었으며, 1년 뒤 오스트레일리아와 러시아의 의학저널에서도 해당국 정신과 의사에 의해 임상경험이 보고되기 시작하였다. 그리고 1955년 10월 프랑스 파리에서 ‘International Colloquium on Chlorpromazine and Neurolepic Drugs in Psychiatric Treatment’라는 국제학술회의가 개최되었다. 이 회의에는 22개국, 약 200여 명의 정신의학자들이 모여 chlorpromazine에 대한 다양한 임상경험과 연구결과에 대하여 활발한 논의를 가졌으며, 1952년 이후의 chlorpromazine에 대한 임상경험을 집대성하여 학술지로 발간하기도 하였다. 당시 보고 내용에 의하면, 대부분의 정신의학자들은 급성 조현병(정신분열병)이나 급성 조증에 대한 약물의 치료효과는 동의하였지만, 만성 정신병, 우울증, 강박증, 공포증 등에 대한 효과는 다소 회의적으로 판단하였다. 또한 약리적 특성으로 antihistamine, anticholinergic, adrenolytic, parasympatholytic, sympatholytic 효과들이 제시되었고, 약물의 작용 부위로 피질하영역 subcortical area이 추정되었으나, 어느 기전도 약물의 임상적 효과를 충분히 설명하지는 못하였다고 기술되어 있다. 오히려 초창기의 학자들은 chlorpromazine의 효과를 심리학적 관점에서 설명하고자 하였다. 즉, 약물이 긴장을 해소시켜 인격의 재결합을 촉진함과 동시에 의사소통을 향상시킴으로써 대인관계가 호전되고 정신증상이 완화된다는 것이었다.\n\n한편, chlorpromazine이 소개된 직후인 1952년 Muller는 인도 관목의 일종인 Rauwolfia Serpentina로부터 추출한 물질에 reserpine이라는 이름을 붙이고 혈압강하제로 사용하였다. 1953년에 Hakim이 Rauwolfia Serpentina의 항정신병 효과를 최초로 보고하였고, 1년 뒤 Kline은 reserpine의 항정신병 효과를 정리하여 발표하였다. Reserpine은 chlorpromazine과 유사한 정도의 항정신병 효과가 있다고 생각되었으며, 약물의 효과에 대한 기대가 높았으나, 코막힘, 설사, 우울증 등 다양한 부작용을 유발하는 것으로 밝혀져 널리 사용되지는 못하였다. 그러나 reserpine의 기전을 연구하는 과정에서, 이 약물이 신경말단의 serotonin 재흡수를 비가역적으로 차단하여 단가아민을 고갈시킨다는 것을 알게 되었다. Reserpine에서 도파민의 역할은 먼 훗날에서야 언급되었고 현재 사용되지는 않지만, 조현병의 dopamine 가설이나 우울증의 단가아민 가설을 수립하는 데 큰 기여를 했다고 볼 수 있다.\n\n이후 여러 제약회사가 chlorpromazine을 원형으로 한 다양한 유도체들을 개발하였으며, 1954년에 mepazine, 1957년에 perphenazine, 그리고 1958년에 trifluoperazine과 thioxanthene 등이 소개되었다. 이들의 약물효과는 거의 유사하였으나, 용량 및 부작용 측면에서 차이가 있었다.\n\nChlorpromazine에 이어 개발된 약물이 바로 butyrophenone계인 haloperidol이다. 1958년 Janssen과 동료들은 보다 강력한 진통제를 개발하기 위하여 pethidine의 화학구조를 변화시켜 새로운 물질을 합성하고 있었다. 그는 pethidine 유도체 중 하나인 R1187에서 chlorpromazine과 유사한 정온효과를 발견하였다. 즉, 이 약물을 투여 받은 동물이 점차 진정되었으며, 강직성 양상을 보이기도 했던 것이다. 이에 고무된 연구자들은 이와 유사한 R1625를 개발하였는데, 그것이 바로 haloperidol이다. 이후에도 많은<|page|>관련 유도체들이 합성되어 항정신병약물로 소개되었다. 그 중에서도 haloperidol은 1970~1980년대에 가장 흔히 처방되던 항정신병약물이었으며, 아직까지 주요 항정신병약물로 사용되고 있다.\n\n항정신병약물에 대한 임상경험이 쌓이면서 연구자들의 관심은 추체외로부작용(extrapyramidal side effect)으로 향했다. 항정신병약물의 항정신병 효과와 운동장애 유발 부작용이 공통적으로 도파민 신경계를 경유한다는 사실이 알려지면서 추체외로부작용이 없을 경우 항정신병 효과도 없을 것이라는 주장이 제기되기도 하였다. 하지만 이러한 믿음은 1971년 추체외로부작용을 거의 야기하지 않는 clozapine이 등장하면서 흔들리게 되었으며, 기존의 항정신병약물과는 다른 '비정형(atypical)' 항정신병약물의 개념이 탄생하는 계기가 되었다.\n\nDibenzodiazepine계 약물인 clozapine은 양성증상뿐 아니라 음성증상에도 효과적이며, 추체외로부작용과 지연성 운동이상(tardive dyskinesia)을 거의 유발하지 않는 것으로 알려져 큰 주목을 받았으나, 무과립구증(agranulocytosis)을 유발할 수 있는 위험성으로 인하여 1975년 제조가 중단되었다. 1989년 미국 FDA에서 주기적인 혈액 검사를 전제로 약물사용을 다시 허가하였고 이후 현재까지 난치성 조현병 환자의 치료에 가장 중요한 약물로 자리매김하고 있다. Clozapine 이후 비정형성을 띠는 약물들의 개발이 촉진되었는데, haloperidol의 특성에 세로토닌 수용체 길항작용을 추가한 약물로서 risperidone과 ziprasidone이 합성되었으며, clozapine으로부터 olanzapine과 quetiapine이 파생되어 널리 사용되고 있다. Thienobenzodiazepine계 약물인 olanzapine은 clozapine과 같은 dibenzodiazepine 형태로 도파민 D2 및 세로토닌 5-HT2A 수용체에 높은 결합력을 지니고 있으며, 현재까지 개발된 비정형 항정신병약물 중 clozapine과 구조적 및 약물학적으로 가장 유사한 약물이다.\n\n이후 도파민 활성의 과다 및 저하가 각 도파민 회로에 따라 서로 다르게 나타난다는 사실이 알려지면서, 이를 동시에 제어할 수 있는 3세대 항정신병약물, 즉 도파민 수용체 부분 효현제(partial agonist)의 개발이 진행되었다. 1980년대 후반 일본 Otsuka사 연구진들은 도파민 자가수용체에 작용하면서 시냅스후 D2 수용체 길항작용을 가진 aripiprazole을 합성하는 데 성공하였다. aripiprazole은 세로토닌 5-HT1A 수용체에 부분 효현제로 작용하고, 세로토닌 5-HT2 수용체에 대하여 길항제로 작용하기 때문에 dopamine-serotonin system stabilizer(DSS)라고 불리기도 한다.\n\n1.2 항우울제 Antidepressants\n\n1950년대 이전에는 hematoporphyrin, amphetamine, opiate, dinitrile, succinate 등이 우울증 치료제로 시도되었다. 그러나 기전적인 측면에서 최초의 항우울제는 결핵 치료제인 iproniazid와 isoniazid였다고 할 수 있다. 1952년 Selikoff는 iproniazid를 복용한 결핵 환자들이 즐거워하고 춤을 추는 등 활동이 증가하는 것을 관찰한 후, 우울증 환자들에게 이 약물을 처방하였다. 하지만 같은 해 Delay는 우울증 환자들에서 isoniazid를 사용한 후 항우울 효과를 관찰하지 못하였다고 보고했다. 이후 Zeller가 isoniazid의 단가아민산화효소(monoamine oxidase, 이하 MAO) 억제 기전을 보고하였고, Chessin이 iproniazid가 reserpine의 효과를 반전시킨다는 연구결과를 발표하였다. 이에 1958년 Saunders와 Kline은 iproniazid를 우울증 환자들에게 다시 사용하였고, 결국 항우울 효과를 입증하게 되었다. 하지만 안전성 문제로 인하여 다른 유도체들이 연구되었으며, MAO 억제제(MAO inhibitor)는 임상에서 널리 사용되지 않았다.\n\n또 다른 형태의 항우울제는 항정신병약물 연구과정에서 개발되었다. 1957년 스위스의 정신과 의사 Kuhn은 Ciba Geigy 제약사의 항정신병약물 후보물질 중 chlorpromazine 유사체인 G22355가 항정신병 효과는 없지만 항우울 효과가 크다는 것을 발견하였다. 그는 40명의 우울증 환자에게 G22355를 투여하고 3주 후 대부분의 우울 증상이 사라지는 것을 관찰하였고, 그 결과를 취리히의 국제학술회의에서 발표하였다. 이후 이 물질은 imipramine으로 명명되었다.<|page|>이후 imipramine과 유사한 유도체들이 연이어 개발되었으며, 이들의 화학구조가 공통적으로 3개의 고리 형태로 이루어져 있어 삼환계항우울제(tricyclic antidepressant, 이하 TCA)라고 불리게 되었다. TCA는 MAO 억제제와 비교하였을 때, 구조 및 작용하는 수용체도 다르지만, 시냅스에서 신경전달물질의 가용성을 증가시킨다는 공통점을 가지고 있다. 하지만 TCA는 변비, 구갈, 시야 흐림 등 anticholinergic 부작용, 체중증가, 졸림 등 antihistamine 부작용, 혈압 강하, 기립성 저혈압 등 alpha-adrenergic 부작용으로 인하여 내약성과 순응도 측면에서 복용에 어려움이 있었다. 따라서 이러한 측면을 개선하기 위하여 소수의 수용체에 작용하는 약물 개발에 많은 노력을 기울이게 되었으며, 그 결과 개발된 약물이 선택적 세로토닌 재흡수 차단제(selective serotonin reuptake inhibitor, 이하 SSRI)이다.\n\n최초의 SSRI는 미국의 Eli Lilly사가 10여 년의 연구 끝에 1988년 출시한 fluoxetine(ProzacⓇ)이었다. 이 약이 세상에 미친 영향은 실로 엄청난 것으로, fluoxetine 이후 항우울제의 내약성이 증가함과 동시에 우울증의 진단 역치는 감소하여 항우울제 복용이 대중적으로 유행처럼 퍼지는 현상을 불러일으키기도 하였다. 그러나 SSRI는 중증의 우울증에 대해서는 TCA에 비하여 효과가 떨어진다는 보고가 있어, 다시 복수의 수용체에 작용하면서 선택적 수용체 아형에 주로 작용하는 약물들이 연구되기 시작하였다. 그 결과 세로토닌-노르에피네프린 재흡수 억제제(serotonin–norepinephrine reuptake inhibitor, 이하 SNRI)와 noradrenergic and specific serotonergic antidepressant(NaSSA) 등이 새로 개발되었으나, 이들이 SSRI나 TCA에 비하여 효과 면에서 더욱 우수한지에 대한 결론은 아직 확실하지 않다.\n\n1.3 기분조절제 Mood stabilizers\n\nLithium이 기분을 안정시키는 효과가 있다는 사실은 기원 후 2세기경부터 알려진 것으로, 그리스-로마 시대의 의사 Galen이 정신질환을 가진 환자의 입욕제로 lithium을 사용했다는 기록이 있다. Lithium은 19세기에 이미 흔하게 사용되었으며, 한때는 청량음료인 세븐업에도 lithium이 혼합된 적이 있었다고 한다. 하지만 오늘날처럼 lithium을 양극성장애의 치료제로 사용한 것은 아니었다. 20세기 초반까지도 양극성 조증에 전통적인 진정제인 bromide, barbiturate, paraldehyde 정도만이 일부 제한적으로 사용되고 있었다.\n\n조증 삽화에 대한 lithium의 효과를 처음으로 이론화한 사람은 오스트레일리아의 정신과 의사 Cade였다. 그는 1949년 lithium과 요산을 섞은 혼합물을 기니피그에 정주한 후 활동이 줄어드는 것을 발견하였다. 이후 Cade는 중증의 조증 상태인 51세 남자에게 lithium을 투여하였으며 만족스러운 결과를 얻었다. 그러나 당시 식이요법의 하나로 염분제거식을 권장하면서 대체성분으로 lithium이 사용된 적이 있었는데, 이때 lithium 독성이 문제가 되어 임상에서의 사용은 급격히 감소하게 되었다. 이러한 상황에서 1950년대 중반 덴마크의 Schou는 독성을 일으키지 않는 범위 내에서 lithium의 항조증 효과를 보고하였다. 그 결과, lithium은 1960년대부터 조증 삽화의 치료제로 상용화되기 시작하였으며, 추후 기분 삽화의 재발을 예방하는 효과도 입증되어 1970년대 이후 최근까지 전 세계적으로 광범위하게 처방되고 있다.\n\n항경련제의 기분조절 효과 역시 20세기 중반부터 인식되고 있었는데, lithium을 대체할 수 있는 약물로 처음 주목을 받은 것은 valproate였다. 1980년대에 들어 조증 삽화의 치료에 carbamazepine도 lithium과 병합요법으로 많이 처방되었으나, 적절한 용량을 찾는 것이 어렵고 혈액학적 및 면역학적 부작용 문제로 현재는 사용이 많이 감소한 실정이다. 1995년에 divalproex sodium 장용정이, 2006년에는 divalproex 서방정이 미국 FDA에서 양극성 조증 치료에 승인되었다. 이후 divalproex와 다양한 형태의 valproate들이 양극성장애의 급성기 치료와 장기적인 유지치료에 널리 쓰이고 있다. 또 다른 항경련제인 lamotrigine은 미국 FDA에서 양극성장애 유지치료에 승인을 받아 최근에 널리 사용되고 있는 약물이다.\n\n최근 양극성장애 환자들에서 기분조절제에 병합 또는 \n<|page|>기분조절제의 대체요법으로 비정형 항정신병약물을 처방받는 경우가 증가하고 있는 추세이다. 대부분의 비정형 항정신병약물이 미국 FDA에서 조증 증상의 치료에 승인을 받았고 기분조절 효과가 있다는 사실이 밝혀지면서 항정신병약물과 기분조절제 간의 구분은 흐려지고 있다.\n\n1.4 항불안제 Anxiolytics\n\n20세기 중반까지 유럽에서는 오늘날의 불안장애를 광범위하게 노이로제(neuroses)라고 불렀으며, 이에 대한 치료법으로 주로 정신치료를 사용하였다. 특히 약물치료는 매우 일부 환자에서만 시도되었고, 그마저도 정신치료를 용이하게 하기 위한 수단으로 이용되었다. 당시 대표적인 진정제는 barbiturate였으며, 경험적으로 술, 아편, 대마 등이 사용되기도 하였으나, 부작용으로 인한 많은 문제점들이 제기되었다.\n\n1940년대 중반 영국의 Berger는 항균제의 연구과정에서 mephenesin이란 물질을 쥐에 투여하였을 때 가역적인 근이완 효과를 관찰하게 되었다. 그는 이 물질의 구조식을 약간 변형시켜 작용시간이 더욱 길고 근이완 효과가 8배 이상 강한 meprobamate를 개발하였다. Meprobamate는 기존의 진정제가 가진 부작용 없이 신경증적 불안만 선택적으로 완화시키는 효과를 나타내어 항불안제로 인정을 받았고, 1950년대 중반부터 임상에서 널리 사용되었다.\n\nMeprobamate의 상업적 성공은 항불안제 개발의 계기가 되었다. 대표적인 약물로서 1963년 Roche 제약사의 Sternbach가 개발한 최초의 benzodiazepine계 항불안제인 chlordiazepoxide가 있다. 이 약물은 meprobamate보다 약물효과가 10배 더 강하고, 순화작용 tamingeffect도 높았다. 이후 diazepam을 비롯한 약 100여 종의 benzodiazepine계 유도체들이 지속적으로 개발되었다. 이 계열의 약물들은 항불안 효과가 우수할 뿐 아니라 barbiturate에 비하여 호흡 억제 효과가 없어 안전하고 효소 촉진 효과도 없는 것으로 나타났다.19 이러한 장점으로 인하여 benzodiazepine계 약물은 단기간에barbiturate와 meprobamate를 대체하게 되었다. 현재까지도 benzodiazepine계 약물들은 가장 널리 쓰이는 항불안제이며, 일부는 수면제 또는 항경련제로 사용되고 있다.benzodiazepine계 약물의 약리 효과는 거의 유사하나, 약 동학적으로만 차이가 있다.19\n\nBenzodiazepine계 약물은 이전의 약물들에 비하여 비교적 안전하지만 진정작용 및 금단증상이 나타날 수 있고,남용과 의존을 유발할 수 있어 장기적인 복용은 문제가 될수 있다. 이후 세로토닌 5-HT1A 부분 효현제인 buspirone이 개발되면서 benzodiazepine계 약물들의 진정작용 및 금단증상, 남용과 의존 문제를 해결하였으나 약물 효과가 복용 후 2주 정도가 경과해야 나타나고, 실제 임상상황에서항불안 효과가 benzodiazepine계 약물들과 동등한지에 대한 논란이 남아 있다.\n\n1.5 한국 정신약물학의 역사\n\n국내에 신경정신계 약물이 도입되기 전에는 인슐린과 전기를 이용한 충격요법 shock therapy이 행해졌다는 기록은 있으나20 구체적인 임상결과나 자료가 보고된 바는 없다.\n\n국내에서도 chlorpromazine이 정신질환에 사용된최초의 치료약물이었다. 신경안정제 tranquilizer로서chlorpromazine이 국내에 소개되고 나서 충격요법의 많은부분을 대체하게 되었다. 이 약물에 대한 최초의 공식 문헌은 1959년 김창선이 한국의약이라는 학술잡지에 기고한“정신신경계영역에 있어서의 chlorpromazine 치험보고”였다.21 이 문헌에서 chlorpromazine은 조현병과 조울병등 정신증은 물론 정신신경증, 진행성 마비, 만성약물중독에도 효과적이었다고 기술되고 있다. Chlorpromazine은1960년부터 국내에 허가를 받아 널리 사용되었는데, 당시의 광고를 보면 이 약물이 다양한 정신신경증상에 효과적이라고 홍보되었으며, 처방전 없이도 약국에서 누구나 구입할 수 있었다.\n\nLithium은 1966년 김채원이 신경정신의학에 처음으로 소개하였는데, 조증은 물론 각종 정신질환의 흥분 증상에 대하여 사용할 수 있다고 기술하였다.22 이후 lithium에 대한 연구가 활발해졌고, 1973년 정식 허가를 받으면서 조증<|page|>에 대한 치료약물로 임상에서 널리 사용하게 되었다. \n\n항우울제로는 imipramine이 가장 먼저 사용되었으며,1964년에는 대표적인 TCA인 amitriptyline이 허가되어 본격적으로 사용되기 시작하였다. 항우울제에 대한 국내 최초의 학술보고는 1969년 오길성이 신경정신의학에 기고한“imipramine과 reserpine 동시 투여에 의한 우울증 치료1례”라는 증례 보고로 imipramine에 효과를 보지 못한 만성 우울증 환자에게 reserpine을 동시 투여하였을 때 효과가 있었다는 보고였다.23\n\n정신약물치료가 활기를 띠기 시작한 것은 haloperidol등의 정형 항정신병약물과 다양한 TCA, 정신신경계 약물들이 국내로 들어오기 시작한 1980년대였다. 정신약물학관련 전문 연구학회인 대한정신약물학회가 창립된 것도1985년 2월 28일이었으며, 초대 회장으로는 연세의대 김채원 교수가 선출되었다. 1980년대 후반에는 TCA의 부작용을 크게 줄인 SSRI가 국내에 도입되면서 우울증과 불안장애에 대한 약물치료가 급성장하였다. fluoxetine24을 시작으로 sertraline,25 paroxetine26 등에 대한 국내 임상 보고가 계속되었으며, 2000년대에는 SNRI인 venlafaxine,27NaSSA인 mirtazapine28 등도 도입되어 임상연구가 시작되었다.\n\n또한 1990년대에는 국내에서도 비정형 항정신병약물이사용되면서 조현병(정신분열병) 치료에 새로운 장이 열렸다. 1993년 “치료 저항 정신분열증 환자에서의 clozapine효과”가 대한정신약물학회지에 처음 보고되었으며,29 뒤이어 “만성 조현병 환자의 risperidone 치료 효과”가 신경정신의학에 발표되었다.30 1996년에는 risperidone이 국내허가를 받았으며, 뒤이어 1997년 olanzapine이 허가되어1999년부터 사용되기 시작했다. Olanzapine에 대한 최초의 공식적 보고는 2000년 “조현병 환자의 입원 치료 상황에서의 risperidone과 olanzapine”이라는 논문이다. 이 논문에서는 조현병 치료에서 olanzapine이 신경학적 부작용의 측면에서 장점을 가지며, risperidone은 경제적인 측면에서 장점이 있다고 보고하였다.31 이후 2001년에는 국내환자를 대상으로 olanzapine의 효과와 안전성에 대한 다기관 공동 임상연구가 시행되었다.32 이후에도 quetiapine, aripiprazole, amisulpride, ziprasidone, paliperidone,blonanserin 등 비정형 항정신병약물 계열의 약물들이 국내에 도입되어 대한정신약물학회를 중심으로 다양한 임상연구를 진행하였다. 또한 일부 비정형 항 정신병약물들은 양극성장애에도 허가를 받아 2002년 이후 활발한 임상연구를 진행하고 있다. 국내에서 시행한 양극성장애 조증 삽화에 대한 대규모 다기관 임상연구는 박원명 등이909명의 환자를 대상으로 한 risperidone 연구가 최초이며 2004년 “risperidone in combination with mood stabilizersfor acute mania: a multicentre, open study”라는 논문으로 International Clinical Psychopharmacology에 게재되었다.33 이러한 새로운 약물들은 미국 FDA 통과 후 2~3년이내의 비교적 빠른 시간 안에 국내에서 허가되었고, 최근에는 EU 국가들에서 개발된 약물까지 미국에 앞서 도입되고 있어, 우리나라의 정신약물치료는 선진국 이상의 수준에 도달하게 되었다.\n\n임상연구도 국제적인 기준에 맞추어 진행되고 있다. 특히 1994년 국내에서 의약품임상시험 관리기준인 KoreanGood Clinical Practice(KGCP)가 제정되고 InstitutionalReview Board(IRB)를 설치 및 운영하는 의료기관이나 연구시설이 급속도로 늘어나면서 국내 임상약물시험과 관련된 정확한 방법론은 물론 피험자 보호와 연구자의 윤리적인 측면이 강조되기 시작하였다.34 이후 국제적 기준에 따른 연구결과들이 대한정신약물학회 회원을 중심으로 활발하게 보고되었으며, 다국적 제약사가 신약 출시를 위한국제 규모의 2~3상 연구를 국내에서 진행하는 경우가 많아졌다.35\n\n또 하나의 발전은 다양한 임상진료지침 clinical practiceguideline의 개발이다. 신약 개발과 더불어 사용할 수 있는 약물이 증가함에 따라 다양한 상황에 따라 여러 치료법의 적용이 가능해지면서, 1990년대부터 선진국을 중심으로 주요 근거 및 권고를 담은 임상진료지침이 활발하게 제작되었다. 이러한 변화에 맞추어 2000년대 들어 국내에서도 근거 및 전문가 합의에 기초한 한국형 임상치료지침들을 개발하기 시작하였다.36 그 결과 대한정신약물학회(이사장 이홍식) 주도로 국내 최초의 ‘조현병 약물<|page|>치료에 대한 한국형 알고리듬 지침서 Korean MedicationAlgorithm of Pharmacotherapy for Schizophrenia’(개발위원장 권준수)37와 ‘한국형 양극성장애 약물치료 지침서 Korean Medication Algorithm for Bipolar Disorder’(개발위원장 박원명)38를 발표하였다. 이후 2006년 대한우울조울병학회와 공동으로 ‘한국형 우울증 약물치료 지침서Korean Medication Algorithm for Depression’,39 대한불안의학회와 공동으로 2007년 ‘한국형 강박장애 치료지침서Korean Treatment Algorithm for Obsessive-CompulsiveDisorder’,40 2008년 ‘한국형 공황장애 약물치료 지침서Korean Medication Algorithm for Panic Disorder’,41 ‘외상후 스트레스장애 근거중심의학 지침서 Evidence-basedMedicine Guideline for Posttraumatic Stress Disorder’42를개발하였으며, 이들 진료지침은 주기적으로 개정되고 있다. 특히 한국형 양극성장애 약물치료 지침서 개정작업이가장 활발하여 2002년 개발 이후에 4년마다 개정작업을 지속하였으며 2014년 세 번째 개정판을 만들었다. 이 밖에도대한불안의학회에서 한국형 범불안장애 약물치료 지침서,보건복지부지정 우울증 임상연구센터에서 근거중심 한국형 우울증 약물학적 치료지침서, 한국중독정신의학회에서중독치료지침서 등을 개발하여 제공하였다. 한국형 임상진료지침의 개발은 외국과 다른 국내 현실을 반영하여 국내 정신과 의사에게 치료 약물 선택에 대한 적절한 판단을돕는 데 큰 의의가 있다.\n\n또한 대한정신약물학회는 1990년도부터 발간해 온 Korean Medical Citation Index 등재 국문학술지인 대한정신약물학회지에 이어 2003년부터 영문학술지인 ClinicalPsychopharmacology and Neurosicences(이하 CPN)를 발행하기 시작하였다. 2013년 현재 CPN은 PubMed Central및 SCOPUS 등재지로서 국내 정신약물 연구현황을 전 세계적으로 알리는 역할을 하고 있으며 SCI 등재를 목표로하고 있다.\n\n1.6 요약\n\n정신약물학은 비약적인 발전을 거듭해 왔으며, 현재까지 새로운 약물의 개발 및 기존 약물에 대한 추가적인효과의 규명이 지속되고 있다. 최초의 항정신병약물로서 chlorpromazine에 이어 haloperidol 등 정형 항정신병약물 및 clozapine, olanzapine, risperidone, ziprasidone,quetiapine 등 비정형 항정신병약물, 도파민 수용체 부분효현제인 aripiprazole 등이 개발되었다. 또한 항우울제는결핵치료제인 iproniazid와 isoniazid에서부터 imipramine등 TCA, 이후 SSRI, SNRI, NaSSA 등이 개발되었다. 기분조절제는 전통적으로 효과를 인정받았던 lithium 및valproate, carbamazepine에 이어 최근 lamotrigine까지 임상에서 널리 사용되고 있다. 그리고 항불안제는meprobamate을 시작으로, benzodiazepine계열 약제 및buspirone이 개발되어 사용되고 있다. 이와 같이 다양한약물의 개발에 더불어 국내에서 약물치료가 활발해지면서임상연구의 증가 및 임상약물시험과 관련된 기준의 발전,그리고 임상진료지침의 개발이 이루어졌다."
  }
]