[
  {
    "title" : "발칙한 수학책",
    "author" : "최정담(디멘)",
    "page": [15,16,17,18,19,20,21,22,23,24,25,26,27,28],
    "text": "① 수학의 언어와 문법\n\n엄밀함과 명료함은 수학의 생명\n\n수학은 신이 우주를 적기 위해 사용한 언어다.\nMathematics is the language in which God has written the universe\n\n갈릴레이가 수학에 관해 남긴 말입니다. 정말 낭만적이죠? 갈릴레이도 수학이라는 언어가 후대 학자들에 의해 얼마나 정교하게 발전할지는 상상도 못했을 겁니다. 이제 수학은 우주를 기술하는 언어를 넘어, 인간의 모든 논리적 추론을 적어낼 수 있는 언어로 발전했습니다.\n\n모든 언어는 기호와 문법으로 이루어져 있습니다. 영어는 라틴 알파벳, 한국어는 한글, 중국어는 한자라는 기호를 사용하죠. 이 기호를 각 언어의 문법에 알맞게 배열하면 문장이 완성됩니다. 마찬<|page|>가지로 수학도 몇 가지의 기호와 문법으로 이루어져 있습니다. 정확히 말하자면, 수학은 단 6개의 기호와 12개의 추론 규칙, 그리고 적절히 정의된 공리계로 이루어져 있는 언어입니다.1\n\n다만 수학이 다른 언어와 구별되는 유일한 점은, 일상 생활에서 서로가 소통하기 위한 언어가 아니라 논리적 추론을 기술하기 위한 언어라는 점입니다. 그리고 논리적 추론이 가능하기 위해서는 모든 문장의 참과 거짓을 확실히 판별할 수 있어야 합니다. 한 치의 애매함도 없이 말이죠.\n\n이제 그 합리적 추론을 위해 가장 간단하게 살펴볼 수 있는 오목과 볼록을 살펴보겠습니다. 우리 모두 오목과 볼록이 어떤 의미인지 직관적으로는 알고 있습니다. 왼쪽의 도형은 오목하고, 오른쪽의 도형은 볼록하죠.\n<|img_start|>Image: Im1, bbox: (81.7795243853285, 404.43842645381983, 429.5223700120919, 564.0535917901939)<|img_end|>\n하지만 우리가 이에 대한 수학적 논의를 시작하고 싶다면, 오목<|page|>과 볼록의 의미를 직관적으로 받아들이지만 말고 수학의 언어를이용해 명확한 문장으로 정의해야 합니다. 용어를 명확하게 정의하지 않으면 수많은 애매한 경우가 생기게 되고, 논리적 오류가 발생할 여지가 커집니다. 예를 들어 도넛의 경우를 볼게요.\n<|img_start|>Image: Im2, bbox: (231.42885933091497, 191.0581527936146, 406.01975010076586, 357.1539338654504)<|img_end|>\n여러분은 도넛이 어떤 도형이라고 생각하나요? 언뜻 보기에는 볼록한 도형 같습니다. 하지만 도넛 구멍 안의 관찰자 입장에서 보면 오목합니다. 관찰자의 위치에 따라서 도형의 오목과 볼록이 달라지다니. 그럼 도넛은 볼록한 걸까요, 오목한 걸까요?<|img_start|>Image: Im3, bbox: (183.94397420395003, 512.6887115165337, 479.16565900846433, 701.5866590649944)<|img_end|>\n<|page|>도넛의 경우처럼 직관에만 의존할 경우 우리는 논리적으로 상충 할 수 있는 애매한 경우를 만나게 됩니다. 그리고 이 애매함은 새로운 수학적 주장을 펼치는 데 큰 장애물이 됩니다. 예를 들어 디멘이 “볼록한 도형끼리 겹치는 부분은 항상 볼록해”라고 주장했다고 할게요.\n<|img_start|>Image: Im4, bbox: (122.54937525191455, 212.66020524515395, 413.69407496977027, 410.91904218928164)<|img_end|>\n이 주장은 명확하지 못한 정의가 우리의 발목을 잡을 수도 있는 예시입니다. 도넛이 볼록하다고 판단할지, 오목하다고 판단할지에 따라 디멘의 주장은 거짓일 수도 있고, 참일 수도 있습니다. 대부분의 경우 디멘의 주장은 맞는 말입니다. 아래와 같이 말이죠.\n<|img_start|>Image: Im5, bbox: (91.61225312374043, 566.4538198403649, 436.95687222894, 713.8278221208666)<|img_end|><|page|>도넛이 볼록한 도형이라면, 다른 볼록한 도형이 만나 겹치는 부분 역시 볼록해야 합니다. (물론 디멘의 주장이 맞다면 말이죠.) 그러나 아래 그림과 같이 도넛의 구멍을 지나도록 타원을 그리면, 겹치는 부분은 오목한 도형이 됩니다. 따라서 이 경우 도넛이 볼록하다는 디멘의 주장은 틀렸습니다.\n<|img_start|>Image: Im6, bbox: (169.31479242241033, 220.82098061573546, 494.993954050786, 386.4367160775371)<|img_end|>\n그럼 도넛을 오목한 도형이라고 해볼게요. 그렇다면 디멘의 주장은 옳은 주장일까요? 글쎄요. 이것도 확실히 옳다고 말하기는 어렵습니다. 만약 디멘의 주장이 틀렸을 경우, 그것을 반증하기는 어렵지 않습니다. 2개의 볼록한 도형이 오목하게 겹치는 단 하나의 경우를 찾아내기만 하면 되기 때문이죠. 하지만 디멘의 주장이 맞을 경우, 그 사실을 증명하는 것은 훨씬 더 어렵습니다. 이 세상에 존재하는, 무수히 많은 볼록한 도형에 대해 디멘의 주장이 성립한다는 것을 보여야 하기 때문입니다. 단순히 몇 가지 예시를 나열하는 것으로는 충분하지 않습니다. 범우주적으로 성립할 수밖에 없는 논리를 찾아내야 합니다. 하지만 지금의 상황처럼 오목과 볼록의 정의가 흐리멍텅하다면, 그 어떤 논리도 이 세상의 모든 볼록한<|page|>도형과 오목한 도형을 올바르게 분석할 수 없습니다.\n<|img_start|>Image: Im7, bbox: (100.96533655783959, 105.12998859749145, 388.5126964933495, 288.2673888255416)<|img_end|>\n이렇게 직관에만 의존하는 수학은 두 가지 문제를 야기시킵니다. 첫째, 개개인의 주관적 판단에 따라 수학적 주장이 참일 수도 거짓일 수도 있는 불명확한 사실이 되어버립니다. 둘째, 어떤 수학적 주장이 참이라는 것을 증명해 보이기가 매우 어려워집니다.\n\n이 문제를 해결하기 위해 이제부터 우리는 세 단계를 거칠 것입니다.\n\n첫 번째로, 수학의 언어는 어떤 기호와 문법으로 이루어져 있는지 알아본 뒤, 그다음 그 언어에 맞추어서 도형의 오목과 볼록을 명확하게 정의할 것이며, 마지막으로 명확한 정의를 길잡이 삼아 디멘의 주장이 맞는 말인지 판단해 보겠습니다.\n\n물론 직관도 수학에서 매우 중요한 역할을 담당합니다. 우리가 오목과 볼록을 명확하게 정의하려는 시도를 시작할 수 있었던 것은, 애초에 오목과 볼록이 어떤 것인지 직관으로나마 알고 있던 덕분이니까요. 직관은 수학자에게 영감을 주고, 수학자들은 이 영감을 명확한 표현으로 기술해서 더 다양한 사실을 논리적으로 밝혀<|page|>나갑니다. 건축가가 새로운 건물을 구상할 때는 직관에 의지해 구상하지만, 실제로 건물을 직관만으로 건축하면 반도 못 가서 무너지고 마는 것과 같습니다. 건축가는 자신의 영감을 설계도에 옮기고, 모든 계산을 마친 다음에 공사를 시작해야 합니다. 건축가와 수학자가 하는 일은 매우 다르지만 자신의 직관을 구체적이고 명확하게 기술하는 것이 핵심이라는 점에서는 같습니다.\n<|img_start|>Image: Im8, bbox: (201.4510278113664, 246.02337514253136, 441.27367996775496, 492.2867730900798)<|img_end|>\n수학의 뼈대를 이루는 12개의 기호\n\n이 세상에는 수많은 색이 있습니다. 하지만 모든 색은 결국 삼원색의 적절한 조합으로 표현할 수 있습니다. 다음 그림 왼쪽의 색은 빨간색을 42.1퍼센트, 초록색을 78.4퍼센트, 파란색을 65.1퍼센트 농도로 섞으면 만들어집니다. 오른쪽의 색 역시 왼쪽과 전혀 다른 색이지만 빨간색, 초록색, 파란색의 조합으로 만들어졌죠.<|page|><|img_start|>Image: Im9, bbox: (95.20959290608626, 71.76681870011403, 431.9205965336558, 249.6237172177879)<|img_end|>\n수학도 마찬가지입니다. 수학에는 삼각형, 원, 자연수, 확률 등 무수히 많은 개념이 있습니다. 그리고 이 개념들에 관한 정리도 무수히 많죠. 하지만 수학의 거의 대부분의 개념은 12개의 기호만 사용해서 표현할 수 있습니다. 12개의 논리 기호는 수학자들이 명료한 표현을 정립하기 위해 신중하게 선택한 결과물입니다. 12개의 논리 기호는 수학의 부품과도 같은 것이죠. 각각의 논리 기호와 그 기호가 의미하는 바는 다음과 같습니다.\n\n하지만 모든 부품이 준비되어 있더라도 각 부품의 설명서가 없다면 딱히 할 수 있는 일이 없겠죠? 그래서 수학자들은 각 기호의 설명서도 준비해 놓았습니다. 그 설명서의 이름은 1차 논리입니다. 1차 논리에는 p가 참이거나 q가 참이라면 p∨q가 참이다 등과 같은 기호의 사용법이 자세히 기술되어 있습니다. (1차 논리의 자세한 설명은 이 책의 부록을 참고해 주세요.)<|page|><|img_start|>Image: Im10, bbox: (159.9617089883112, 64.08608893956671, 511.7815397017332, 509.8084378563284)<|img_end|>\n1차 논리 이외의 설명서도 있습니다. 2차 논리가 대표적이죠.2 1차 논리와 2차 논리라는 어려운 말이 당혹스러울 법도 한데, 책에서 깊게 다루지는 않으니 걱정하지 않으셔도 됩니다. 단지 수학은 주로<|page|>12개의 논리 기호만을 사용하며, 이 기호를 잘 조합하면 다양한 수학적 개념을 얻을 수 있다는 사실만 기억해 주세요.그토록 어렵고 복잡해 보이는 수학이 고작 12개의 기호로 구성되어 있다는 사실이 놀랍지 않으신가요? 게다가 대부분의 기호는 그다지 어려운 의미도 아닙니다. 그리고, 또는, 어떤… 이러한 말은 우리가 일상에서 자주 쓰는 말입니다. 하지만 이 기호들은 우리가 생각하는 것 이상의 힘을 가지고 있습니다.\n\n\"수학의 모든 용어는 이미 정의된 용어와 논리 기호만으로 정의됩니다.\"\n\n우리는 이 책에서 12개의 기호에 ∈(~에 속하는) 기호까지 추가해 살피겠습니다. ∈ 기호는 “한국 ∈ 아시아”와 같이 포함된 관계를 나타낼 때 씁니다. 이 기호와 논리 기호 사이의 관계는 이 책에서 설명하기에는 매우 벅차기 때문에 안타깝지만 넘어가겠습니다. (궁금하면 수학과로 오세요!)\n\n앞서 살펴본 기호는 외우면 좋지만 안 외워도 괜찮습니다. 그리고 예리한 독자 분들은 제가 중간에 말을 살짝 바꿨다는 것을 눈치챘을 겁니다. 분명 도입부에는 기호의 개수가 6개라고 했는데 정작 소개한 기호는 12개입니다. 이것에 대한 자세한 얘기 또한 논리 기호에 대한 설명과 함께 부록에 소개되어 있습니다.<|page|>논리 기호로 오목과 볼록을 표현해보자\n\n이제 논리 기호로 오목과 볼록을 표현해 봅시다. 그러기 위해 먼저 ‘오목하다’의 본질을 파악해야 합니다. 먼저 대표적인 오목한 도형과, 볼록한 도형을 살펴볼게요.\n<|img_start|>Image: Im11, bbox: (157.80330511890367, 237.86259977194985, 488.9983877468763, 405.1584948688712)<|img_end|>\n왜 우리는 왼쪽은 오목하고 오른쪽은 볼록하다고 생각할까요? 대부분이 왼쪽 도형은 위아래가 튀어나와 있고 그 사이가 안으로 움푹 들어가 있기 때문에 오목하다고 생각합니다. 반면 오른쪽의 도형은 튀어나온 부분이 없습니다. 이 사실을 종합해 볼 때 아마도 위아\n래로 튀어나온 부분이 도형에게 오목함을 부여하는 것 같습니다.<|img_start|>Image: Im12, bbox: (241.7412333736397, 589.976054732041, 422.56751309955666, 786.314709236032)<|img_end|>\n<|page|>하지만 ‘위아래로 튀어나온 영역’이라는 말은 여전히 모호합니다. 어디에서부터 어디까지가 ‘위아래로 튀어나온 영역’인지 애매하기 때문입니다. 이 영역을 더 구체적으로 다룰 수 있는 한 가지 방법은 ‘위아래로 튀어나온 영역’을 각각 하나의 점으로 대표해 표기하는 것입니다. ‘대한민국의 의견’은 매우 모호한 표현이지만, ‘대통령의 의견’은 명확한 의견이듯이 우리도 그림에서 동그라미 친 영역을 각각 단 하나의 점으로 대표해 볼게요.\n<|img_start|>Image: Im13, bbox: (182.26521563885532, 270.50570125427595, 340.06852075775896, 417.87970353477766)<|img_end|>\n이제 우리가 해야 하는 일은 두 점 사이에 움푹 들어간 영역이 있다는 걸 표현하는 겁니다. 여기서 기발한 아이디어가 등장합니다. ‘두 점 사이에 움푹 들어간 영역이 있다’는 것은, 거꾸로 생각하면 ‘두 점 사이에 빈 공간이 있다’는 말입니다. 두 점 사이를 좀 더 구체화하면 두 점 사이를 이은 선으로 생각할 수 있습니다. 즉 오목한도형의 특징은 ‘어떤 두 점을 이은 선이 도형 밖을 지나간다’는 것입니다. 바로 이것이 오목을 정의하는 핵심입니다!<|img_start|>Image: Im14, bbox: (179.8669891172914, 637.7405929304447, 331.91455058444177, 787.9948688711517)<|img_end|>\n<|page|>오목한 도형의 경우 우리가 두 점을 적절히 잡으면 그 두 점을 이은 선이 도형 밖으로 나가게 됩니다. 하지만 볼록한 도형은 어떻게 두 점을 잡든 간에 선이 도형 밖으로 나가지 않습니다.\n<|img_start|>Image: Im15, bbox: (154.20596533655785, 167.77594070695554, 517.0576380491738, 280.5866590649943)<|img_end|>\n이 결과를 깔끔하게 논리 기호로 정리하면 다음과 같습니다. S는 주어진 도형을, L(x, y) 는 두 점 x와 y를 잇는 선분을 의미합니다.\n<|img_start|>Image: Im16, bbox: (133.82103990326482, 374.19555302166475, 525.9310761789601, 575.814709236032)<|img_end|>\n이 얼마나 명료하고 아름다운 정의인가요? 그저 추상적으로만 \n<|page|>다가왔던 볼록과 오목의 개념을 ‘도형 밖으로 나오는 선의 유무’로 구체화했습니다. 이제 우리는 도형의 오목과 볼록을 명확하게 판단할 수 있는 힘이 생겼습니다. 우리를 혼란스럽게 만든 도넛도 이제는 별거 아닙니다. 보아하니 도넛의 위와 아래에 점을 찍은 뒤 이으면 선이 도형 밖을 지나게 됩니다. 즉 수학적으로 도넛은 오목한 도형입니다!\n<|img_start|>Image: Im17, bbox: (169.31479242241033, 241.9429874572406, 334.79242241031847, 411.639110604333)<|img_end|>\n여기서 두 가지 짚고 넘어갈 점이 있습니다. 먼저 수학에서는 ‘오목한 도형’이라는 표현 대신 ‘볼록하지 않은 도형’이라는 표현을 권장합니다. 수학에서 정의하는 오목과 우리의 직관 속 오목은 괴리감이 크기 때문입니다. 이 책에서는 ‘오목한 도형’이라는 표현과 ‘볼록하지 않은 도형’이라는 표현을 혼용해서 사용하겠습니다.\n\n둘째로, 몇몇 독자 분들은 “에? 근데 지금 볼록과 오목의 정의에도 ‘내부’, ‘도형’, ‘선분’, ‘점’ 등 논리 기호가 아닌 단어가 많이 포함되어 있는데?”라고 의문을 제기했을 겁니다. 맞는 말이지만, 이 용어들은 이미 논리 기호로 잘 정의되어 있습니다. (이에 대해서는 뒤에서 살펴보겠습니다.)"
  }
]